---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsBuildingConstructionclass
source: html/c1f67d9e-5980-a9ab-97a7-d657173c3590.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsBuildingConstructionclass Property

"Building Infiltration Class"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsBuildingConstructionclass { get; }
```